Add mermaid diagrams, Aruvi logo for docs
